; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_1 ?v8 ?v4)
             (pred_10 ?v11 ?v10)
             (pred_3 ?v8 ?v10)
             (pred_7 ?v6 ?v8 )
	     (pred_4 ?v8)
             (pred_8 ?v5)
             (pred_11 ?v11)
             (pred_12 ?v10)
             (pred_2 ?v8)
             (pred_9 ?v11)
             (pred_5 ?v8)
             (pred_6 ))



(:action op_3
:parameters (?v9 ?v13 ?v7 ?v2)
:precondition (and (pred_8 ?v9) (pred_8 ?v13) (pred_11 ?v7) (pred_12 ?v2)
          (pred_1 ?v9 ?v13) (pred_10 ?v7 ?v2)
                   (pred_3 ?v13 ?v2) (pred_4 ?v9) 
                   (pred_2 ?v13) (pred_9 ?v7))
:effect (and  (pred_5 ?v13) (not (pred_2 ?v13))))


(:action op_1
:parameters (?v9 ?v3)
:precondition (and (pred_8 ?v9) (pred_8 ?v3)
               (pred_4 ?v9) (pred_1 ?v9 ?v3) (pred_5 ?v3))
:effect (and (pred_4 ?v3) (not (pred_4 ?v9))))

(:action op_2
:parameters (?v9 ?v7)
:precondition (and (pred_8 ?v9) (pred_11 ?v7) 
                  (pred_4 ?v9) (pred_7 ?v7 ?v9) (pred_6 ))
:effect (and (pred_9 ?v7)
   (not (pred_7 ?v7 ?v9)) (not (pred_6 ))))


(:action op_5
:parameters (?v9 ?v12 ?v1)
:precondition (and (pred_8 ?v9) (pred_11 ?v12) (pred_11 ?v1)
                  (pred_4 ?v9) (pred_9 ?v1) (pred_7 ?v12 ?v9))
:effect (and (pred_9 ?v12) (pred_7 ?v1 ?v9)
        (not (pred_9 ?v1)) (not (pred_7 ?v12 ?v9))))

(:action op_4
:parameters (?v9 ?v7)
:precondition (and (pred_8 ?v9) (pred_11 ?v7) 
                  (pred_4 ?v9) (pred_9 ?v7))
:effect (and (pred_6 ) (pred_7 ?v7 ?v9) (not (pred_9 ?v7)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_22 obj_25 obj_11 obj_06 obj_19 obj_18 obj_16 obj_15 obj_17 obj_21 obj_09 obj_26 obj_28 obj_01 obj_04 obj_10 obj_03 obj_08 obj_07 obj_20 obj_12 obj_29 obj_23 obj_14 obj_13
    obj_27 obj_05
    obj_02 obj_24 obj_30
    )

    (:init
       (pred_6)

       (pred_8 obj_22)
       (pred_8 obj_25)
       (pred_8 obj_11)
       (pred_8 obj_06)
       (pred_8 obj_19)
       (pred_8 obj_18)
       (pred_8 obj_16)
       (pred_8 obj_15)
       (pred_8 obj_17)
       (pred_8 obj_21)
       (pred_8 obj_09)
       (pred_8 obj_26)
       (pred_8 obj_28)
       (pred_8 obj_01)
       (pred_8 obj_04)
       (pred_8 obj_10)
       (pred_8 obj_03)
       (pred_8 obj_08)
       (pred_8 obj_07)
       (pred_8 obj_20)
       (pred_8 obj_12)
       (pred_8 obj_29)
       (pred_8 obj_23)
       (pred_8 obj_14)
       (pred_8 obj_13)
       (pred_12 obj_27)
       (pred_12 obj_05)
       (pred_11 obj_02)
       (pred_11 obj_24)
       (pred_11 obj_30)

       (pred_1 obj_22 obj_18)
       (pred_1 obj_22 obj_25)
       (pred_1 obj_25 obj_16)
       (pred_1 obj_25 obj_11)
       (pred_1 obj_25 obj_22)
       (pred_1 obj_11 obj_15)
       (pred_1 obj_11 obj_06)
       (pred_1 obj_11 obj_25)
       (pred_1 obj_06 obj_17)
       (pred_1 obj_06 obj_19)
       (pred_1 obj_06 obj_11)
       (pred_1 obj_19 obj_21)
       (pred_1 obj_19 obj_06)
       (pred_1 obj_18 obj_09)
       (pred_1 obj_18 obj_16)
       (pred_1 obj_18 obj_22)
       (pred_1 obj_16 obj_26)
       (pred_1 obj_16 obj_15)
       (pred_1 obj_16 obj_25)
       (pred_1 obj_16 obj_18)
       (pred_1 obj_15 obj_28)
       (pred_1 obj_15 obj_17)
       (pred_1 obj_15 obj_11)
       (pred_1 obj_15 obj_16)
       (pred_1 obj_17 obj_01)
       (pred_1 obj_17 obj_21)
       (pred_1 obj_17 obj_06)
       (pred_1 obj_17 obj_15)
       (pred_1 obj_21 obj_04)
       (pred_1 obj_21 obj_19)
       (pred_1 obj_21 obj_17)
       (pred_1 obj_09 obj_10)
       (pred_1 obj_09 obj_26)
       (pred_1 obj_09 obj_18)
       (pred_1 obj_26 obj_03)
       (pred_1 obj_26 obj_28)
       (pred_1 obj_26 obj_16)
       (pred_1 obj_26 obj_09)
       (pred_1 obj_28 obj_08)
       (pred_1 obj_28 obj_01)
       (pred_1 obj_28 obj_15)
       (pred_1 obj_28 obj_26)
       (pred_1 obj_01 obj_07)
       (pred_1 obj_01 obj_04)
       (pred_1 obj_01 obj_17)
       (pred_1 obj_01 obj_28)
       (pred_1 obj_04 obj_20)
       (pred_1 obj_04 obj_21)
       (pred_1 obj_04 obj_01)
       (pred_1 obj_10 obj_12)
       (pred_1 obj_10 obj_03)
       (pred_1 obj_10 obj_09)
       (pred_1 obj_03 obj_29)
       (pred_1 obj_03 obj_08)
       (pred_1 obj_03 obj_26)
       (pred_1 obj_03 obj_10)
       (pred_1 obj_08 obj_23)
       (pred_1 obj_08 obj_07)
       (pred_1 obj_08 obj_28)
       (pred_1 obj_08 obj_03)
       (pred_1 obj_07 obj_14)
       (pred_1 obj_07 obj_20)
       (pred_1 obj_07 obj_01)
       (pred_1 obj_07 obj_08)
       (pred_1 obj_20 obj_13)
       (pred_1 obj_20 obj_04)
       (pred_1 obj_20 obj_07)
       (pred_1 obj_12 obj_29)
       (pred_1 obj_12 obj_10)
       (pred_1 obj_29 obj_23)
       (pred_1 obj_29 obj_03)
       (pred_1 obj_29 obj_12)
       (pred_1 obj_23 obj_14)
       (pred_1 obj_23 obj_08)
       (pred_1 obj_23 obj_29)
       (pred_1 obj_14 obj_13)
       (pred_1 obj_14 obj_07)
       (pred_1 obj_14 obj_23)
       (pred_1 obj_13 obj_20)
       (pred_1 obj_13 obj_14)
       (pred_2 obj_28)
       (pred_2 obj_07)
       (pred_2 obj_09)
       (pred_3  obj_28 obj_27)
       (pred_3  obj_07 obj_05)
       (pred_3  obj_09 obj_27)
       (pred_5 obj_22)
       (pred_5 obj_25)
       (pred_5 obj_11)
       (pred_5 obj_06)
       (pred_5 obj_19)
       (pred_5 obj_18)
       (pred_5 obj_16)
       (pred_5 obj_15)
       (pred_5 obj_17)
       (pred_5 obj_21)
       (pred_5 obj_26)
       (pred_5 obj_01)
       (pred_5 obj_04)
       (pred_5 obj_10)
       (pred_5 obj_03)
       (pred_5 obj_08)
       (pred_5 obj_20)
       (pred_5 obj_12)
       (pred_5 obj_29)
       (pred_5 obj_23)
       (pred_5 obj_14)
       (pred_5 obj_13)

       (pred_10  obj_02 obj_27)
       (pred_10  obj_24 obj_05)
       (pred_10  obj_30 obj_27)
       (pred_7 obj_02 obj_16)
       (pred_7 obj_24 obj_10)
       (pred_7 obj_30 obj_11)
       (pred_4 obj_23)
    )

    (:goal (and
       (pred_7 obj_30 obj_01)
    ))
(:constraints
  (always (not (pred_4 obj_08)))
)
)

; plan
1. (op_1 obj_23 obj_14)
   deleted: (pred_4 obj_23)
   added: (pred_4 obj_14)
   goals met: 0 of 1
2. (op_1 obj_14 obj_13)
   deleted: (pred_4 obj_14)
   added: (pred_4 obj_13)
   goals met: 0 of 1
3. (op_1 obj_13 obj_20)
   deleted: (pred_4 obj_13)
   added: (pred_4 obj_20)
   goals met: 0 of 1
4. (op_1 obj_20 obj_04)
   deleted: (pred_4 obj_20)
   added: (pred_4 obj_04)
   goals met: 0 of 1
5. (op_1 obj_04 obj_01)
   deleted: (pred_4 obj_04)
   added: (pred_4 obj_01)
   goals met: 0 of 1
6. (op_1 obj_01 obj_17)
   deleted: (pred_4 obj_01)
   added: (pred_4 obj_17)
   goals met: 0 of 1
7. (op_1 obj_17 obj_06)
   deleted: (pred_4 obj_17)
   added: (pred_4 obj_06)
   goals met: 0 of 1
8. (op_1 obj_06 obj_11)
   deleted: (pred_4 obj_06)
   added: (pred_4 obj_11)
   goals met: 0 of 1
9. (op_2 obj_11 obj_30)
   deleted: (pred_7 obj_30 obj_11) (pred_6)
   added: (pred_9 obj_30)
   goals met: 0 of 1
10. (op_1 obj_11 obj_06)
   deleted: (pred_4 obj_11)
   added: (pred_4 obj_06)
   goals met: 0 of 1
11. (op_1 obj_06 obj_17)
   deleted: (pred_4 obj_06)
   added: (pred_4 obj_17)
   goals met: 0 of 1
12. (op_1 obj_17 obj_01)
   deleted: (pred_4 obj_17)
   added: (pred_4 obj_01)
   goals met: 0 of 1
13. (op_4 obj_01 obj_30)
   deleted: (pred_9 obj_30)
   added: (pred_6) (pred_7 obj_30 obj_01)
   goals met: 1 of 1
